wtcat/mcuTask/board/stm32/h750_core/stm32_usbdevice.c
/*
 * Copyright 2024 wtcat
 */

#define TX_USE_BOARD_PRIVATE

#define pr_fmt(fmt) "[stm32_usb]: " fmt
#include "tx_api.h"
#include <errno.h>

#define UX_SOURCE_CODE
#include "ux_api.h"
#include "ux_device_stack.h"
#include "ux_device_class_storage.h"
#include "ux_utility.h"

#include "base/log.h"

#include "stm32h7xx_hal_pcd.h"

#define UX_MEMORY_SIZE (28 * 1024)
#define _UX_ERR(_err) -(__ELASTERROR + (int)(_err))
#define STATIC_UINT static UINT

/* Define STM32 generic equivalences.  */

#define UX_DCD_STM32_SLAVE_CONTROLLER 0x80
#ifndef UX_DCD_STM32_MAX_ED
#define UX_DCD_STM32_MAX_ED 4
#endif /* UX_DCD_STM32_MAX_ED */
#define UX_DCD_STM32_IN_FIFO 3

#define UX_DCD_STM32_FLUSH_RX_FIFO 0x00000010
#define UX_DCD_STM32_FLUSH_TX_FIFO 0x00000020
#define UX_DCD_STM32_FLUSH_FIFO_ALL 0x00000010
#define UX_DCD_STM32_ENDPOINT_SPACE_SIZE 0x00000020
#define UX_DCD_STM32_ENDPOINT_CHANNEL_SIZE 0x00000020

/* Define USB STM32 physical endpoint status definition.  */

#define UX_DCD_STM32_ED_STATUS_UNUSED 0u
#define UX_DCD_STM32_ED_STATUS_USED 1u
#define UX_DCD_STM32_ED_STATUS_TRANSFER 2u
#define UX_DCD_STM32_ED_STATUS_STALLED 4u
#define UX_DCD_STM32_ED_STATUS_DONE 8u
#define UX_DCD_STM32_ED_STATUS_SETUP_IN (1u << 8)
#define UX_DCD_STM32_ED_STATUS_SETUP_STATUS (2u << 8)
#define UX_DCD_STM32_ED_STATUS_SETUP_OUT (3u << 8)
#define UX_DCD_STM32_ED_STATUS_SETUP (3u << 8)
#define UX_DCD_STM32_ED_STATUS_TASK_PENDING (1u << 10)

/* Define USB STM32 physical endpoint state machine definition.  */

#define UX_DCD_STM32_ED_STATE_IDLE 0
#define UX_DCD_STM32_ED_STATE_DATA_TX 1
#define UX_DCD_STM32_ED_STATE_DATA_RX 2
#define UX_DCD_STM32_ED_STATE_STATUS_TX 3
#define UX_DCD_STM32_ED_STATE_STATUS_RX 4

/* Define USB STM32 device callback notification state definition.  */

#define UX_DCD_STM32_SOF_RECEIVED 0xF0U
#define UX_DCD_STM32_DEVICE_CONNECTED 0xF1U
#define UX_DCD_STM32_DEVICE_DISCONNECTED 0xF2U
#define UX_DCD_STM32_DEVICE_RESUMED 0xF3U
#define UX_DCD_STM32_DEVICE_SUSPENDED 0xF4U

/* Define USB STM32 endpoint transfer status definition.  */

#define UX_DCD_STM32_ED_TRANSFER_STATUS_IDLE 0
#define UX_DCD_STM32_ED_TRANSFER_STATUS_SETUP 1
#define UX_DCD_STM32_ED_TRANSFER_STATUS_IN_COMPLETION 2
#define UX_DCD_STM32_ED_TRANSFER_STATUS_OUT_COMPLETION 3

/* Define USB STM32 physical endpoint structure.  */

typedef struct UX_DCD_STM32_ED_STRUCT {
	struct UX_SLAVE_ENDPOINT_STRUCT *ux_dcd_stm32_ed_endpoint;
	ULONG ux_dcd_stm32_ed_status;
	UCHAR ux_dcd_stm32_ed_state;
	UCHAR ux_dcd_stm32_ed_index;
	UCHAR ux_dcd_stm32_ed_direction;
	UCHAR reserved;
} UX_DCD_STM32_ED;

/* Define USB STM32 DCD structure definition.  */
typedef struct UX_DCD_STM32_STRUCT {
	struct UX_SLAVE_DCD_STRUCT *ux_dcd_stm32_dcd_owner;
	struct UX_DCD_STM32_ED_STRUCT ux_dcd_stm32_ed[UX_DCD_STM32_MAX_ED];
#if defined(UX_DEVICE_BIDIRECTIONAL_ENDPOINT_SUPPORT)
	struct UX_DCD_STM32_ED_STRUCT ux_dcd_stm32_ed_in[UX_DCD_STM32_MAX_ED];
#endif /* defined(UX_DEVICE_BIDIRECTIONAL_ENDPOINT_SUPPORT) */
	PCD_HandleTypeDef *pcd_handle;
} UX_DCD_STM32;

/* Local interface declare */
STATIC_UINT _ux_dcd_stm32_initialize_complete(VOID);
STATIC_UINT _ux_dcd_stm32_endpoint_stall(UX_DCD_STM32 *dcd_stm32, 
    UX_SLAVE_ENDPOINT *endpoint);


static inline struct UX_DCD_STM32_ED_STRUCT *
_stm32_ed_get(UX_DCD_STM32 *dcd_stm32, ULONG ep_addr) {
#if defined(UX_DEVICE_BIDIRECTIONAL_ENDPOINT_SUPPORT)
	ULONG ep_dir = ep_addr & 0x80u;
#endif /* defined(UX_DEVICE_BIDIRECTIONAL_ENDPOINT_SUPPORT) */
	ULONG ep_num = ep_addr & 0x7Fu;

	if (ep_num >= UX_DCD_STM32_MAX_ED ||
		ep_num >= dcd_stm32->pcd_handle->Init.dev_endpoints)
		return (UX_NULL);

#if defined(UX_DEVICE_BIDIRECTIONAL_ENDPOINT_SUPPORT)
	if (ep_dir)
		return (&dcd_stm32->ux_dcd_stm32_ed_in[ep_num]);
#endif /* defined(UX_DEVICE_BIDIRECTIONAL_ENDPOINT_SUPPORT) */

	return (&dcd_stm32->ux_dcd_stm32_ed[ep_num]);
}

static inline void 
_ux_dcd_stm32_setup_in(UX_DCD_STM32_ED *ed, UX_SLAVE_TRANSFER *transfer_request) {
	/* The endpoint is IN.  This is important to memorize the direction for the control
	   endpoint in case of a STALL. */
	ed->ux_dcd_stm32_ed_direction = UX_ENDPOINT_IN;

	/* Set the state to TX.  */
	ed->ux_dcd_stm32_ed_state = UX_DCD_STM32_ED_STATE_DATA_TX;

	/* Call the Control Transfer dispatcher.  */
	_ux_device_stack_control_request_process(transfer_request);
}

static inline void 
_ux_dcd_stm32_setup_out(UX_DCD_STM32_ED *ed, UX_SLAVE_TRANSFER *transfer_request, 
    PCD_HandleTypeDef *hpcd) {
	/* Set the completion code to no error.  */
	transfer_request->ux_slave_transfer_request_completion_code = UX_SUCCESS;

	/* The endpoint is IN.  This is important to memorize the direction for the control
	   endpoint in case of a STALL. */
	ed->ux_dcd_stm32_ed_direction = UX_ENDPOINT_IN;

	/* We are using a Control endpoint on a OUT transaction and there was a payload.  */
	if (_ux_device_stack_control_request_process(transfer_request) == UX_SUCCESS) {
		/* Set the state to STATUS phase TX.  */
		ed->ux_dcd_stm32_ed_state = UX_DCD_STM32_ED_STATE_STATUS_TX;

		/* Arm the status transfer.  */
		HAL_PCD_EP_Transmit(hpcd, 0x00U, UX_NULL, 0U);
	}
}

static inline void 
_ux_dcd_stm32_setup_status(UX_DCD_STM32_ED *ed, UX_SLAVE_TRANSFER *transfer_request, 
    PCD_HandleTypeDef *hpcd) {
	/* The endpoint is IN.  This is important to memorize the direction for the control
	   endpoint in case of a STALL. */
	ed->ux_dcd_stm32_ed_direction = UX_ENDPOINT_IN;

	/* Call the Control Transfer dispatcher.  */
	if (_ux_device_stack_control_request_process(transfer_request) == UX_SUCCESS) {
		/* Set the state to STATUS RX.  */
		ed->ux_dcd_stm32_ed_state = UX_DCD_STM32_ED_STATE_STATUS_RX;
		HAL_PCD_EP_Transmit(hpcd, 0x00U, UX_NULL, 0U);
	}
}

void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd) {
	UX_SLAVE_DCD *dcd;
	UX_DCD_STM32 *dcd_stm32;
	UX_DCD_STM32_ED *ed;
	UX_SLAVE_TRANSFER *transfer_request;
	UX_SLAVE_ENDPOINT *endpoint;

	/* Get the pointer to the DCD.  */
	dcd = &_ux_system_slave->ux_system_slave_dcd;

	/* Get the pointer to the STM32 DCD.  */
	dcd_stm32 = (UX_DCD_STM32 *)dcd->ux_slave_dcd_controller_hardware;

	/* Fetch the address of the physical endpoint.  */
	ed = &dcd_stm32->ux_dcd_stm32_ed[0];

	/* Get the pointer to the transfer request.  */
	transfer_request = &ed->ux_dcd_stm32_ed_endpoint->ux_slave_endpoint_transfer_request;

	/* Copy setup data to transfer request.  */
	_ux_utility_memory_copy(transfer_request->ux_slave_transfer_request_setup,
							hpcd->Setup, UX_SETUP_SIZE);

	/* Clear the length of the data received.  */
	transfer_request->ux_slave_transfer_request_actual_length = 0;

	/* Mark the phase as SETUP.  */
	transfer_request->ux_slave_transfer_request_type = UX_TRANSFER_PHASE_SETUP;

	/* Mark the transfer as successful.  */
	transfer_request->ux_slave_transfer_request_completion_code = UX_SUCCESS;

	/* Set the status of the endpoint to not stalled.  */
	ed->ux_dcd_stm32_ed_status &=
		~(UX_DCD_STM32_ED_STATUS_STALLED | UX_DCD_STM32_ED_STATUS_TRANSFER |
		  UX_DCD_STM32_ED_STATUS_DONE);

	/* Check if the transaction is IN.  */
	if (*transfer_request->ux_slave_transfer_request_setup & UX_REQUEST_IN) {
#if defined(UX_DEVICE_STANDALONE)
		ed->ux_dcd_stm32_ed_status |= UX_DCD_STM32_ED_STATUS_SETUP_IN;
#else
		_ux_dcd_stm32_setup_in(ed, transfer_request);
#endif
	} else {
		/* The endpoint is OUT.  This is important to memorize the direction for the
		   control endpoint in case of a STALL. */
		ed->ux_dcd_stm32_ed_direction = UX_ENDPOINT_OUT;

		/* We are in a OUT transaction. Check if there is a data payload. If so, wait for
		   the payload to be delivered.  */
		if (*(transfer_request->ux_slave_transfer_request_setup + 6) == 0 &&
			*(transfer_request->ux_slave_transfer_request_setup + 7) == 0) {
#if defined(UX_DEVICE_STANDALONE)
			ed->ux_dcd_stm32_ed_status |= UX_DCD_STM32_ED_STATUS_SETUP_STATUS;
#else
			_ux_dcd_stm32_setup_status(ed, transfer_request, hpcd);
#endif
		} else {
			/* Get the pointer to the logical endpoint from the transfer request.  */
			endpoint = transfer_request->ux_slave_transfer_request_endpoint;

			/* Get the length we expect from the SETUP packet.  */
			transfer_request->ux_slave_transfer_request_requested_length =
				_ux_utility_short_get(transfer_request->ux_slave_transfer_request_setup +
									  6);

			/* Check if we have enough space for the request.  */
			if (transfer_request->ux_slave_transfer_request_requested_length >
				UX_SLAVE_REQUEST_CONTROL_MAX_LENGTH) {
				/* No space available, stall the endpoint.  */
				_ux_dcd_stm32_endpoint_stall(dcd_stm32, endpoint);

				/* Next phase is a SETUP.  */
				ed->ux_dcd_stm32_ed_state = UX_DCD_STM32_ED_STATE_IDLE;

#if defined(UX_DEVICE_STANDALONE)
				ed->ux_dcd_stm32_ed_status |= UX_DCD_STM32_ED_STATUS_SETUP_STATUS;
#endif

				/* We are done.  */
				return;
			} else {
				/* Reset what we have received so far.  */
				transfer_request->ux_slave_transfer_request_actual_length = 0;

				/* And reprogram the current buffer address to the beginning of the
				 * buffer.  */
				transfer_request->ux_slave_transfer_request_current_data_pointer =
					transfer_request->ux_slave_transfer_request_data_pointer;

				/* Receive data.  */
				HAL_PCD_EP_Receive(
					hpcd, endpoint->ux_slave_endpoint_descriptor.bEndpointAddress,
					transfer_request->ux_slave_transfer_request_current_data_pointer,
					transfer_request->ux_slave_transfer_request_requested_length);

				/* Set the state to RX.  */
				ed->ux_dcd_stm32_ed_state = UX_DCD_STM32_ED_STATE_DATA_RX;
			}
		}
	}
}

