wtcat/mcuTask/board/stm32/h750_core/stm32_usbdevice.c
void HAL_PCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum) {
	UX_SLAVE_DCD *dcd;
	UX_DCD_STM32 *dcd_stm32;
	UX_DCD_STM32_ED *ed;
	UX_SLAVE_TRANSFER *transfer_request;
	ULONG transfer_length;
	UX_SLAVE_ENDPOINT *endpoint;

	/* Get the pointer to the DCD.  */
	dcd = &_ux_system_slave->ux_system_slave_dcd;

	/* Get the pointer to the STM32 DCD.  */
	dcd_stm32 = (UX_DCD_STM32 *)dcd->ux_slave_dcd_controller_hardware;

	/* Fetch the address of the physical endpoint.  */
#if defined(UX_DEVICE_BIDIRECTIONAL_ENDPOINT_SUPPORT)
	if ((epnum & 0xF) != 0)
		ed = &dcd_stm32->ux_dcd_stm32_ed_in[epnum & 0xF];
	else
#endif /* defined(UX_DEVICE_BIDIRECTIONAL_ENDPOINT_SUPPORT) */
		ed = &dcd_stm32->ux_dcd_stm32_ed[epnum & 0xF];

	/* Get the pointer to the transfer request.  */
	transfer_request =
		&(ed->ux_dcd_stm32_ed_endpoint->ux_slave_endpoint_transfer_request);

	/* Endpoint 0 is different.  */
	if (epnum == 0U) {
		/* Get the pointer to the logical endpoint from the transfer request.  */
		endpoint = transfer_request->ux_slave_transfer_request_endpoint;

		/* Check if we need to send data again on control endpoint. */
		if (ed->ux_dcd_stm32_ed_state == UX_DCD_STM32_ED_STATE_DATA_TX) {
			/* Arm Status transfer.  */
			HAL_PCD_EP_Receive(hpcd, 0, 0, 0);

			/* Are we done with this transfer ? */
			if (transfer_request->ux_slave_transfer_request_in_transfer_length <=
				endpoint->ux_slave_endpoint_descriptor.wMaxPacketSize) {
				/* There is no data to send but we may need to send a Zero Length Packet.
				 */
				if (transfer_request->ux_slave_transfer_request_force_zlp == UX_TRUE) {
					/* Arm a ZLP packet on IN.  */
					HAL_PCD_EP_Transmit(
						hpcd, endpoint->ux_slave_endpoint_descriptor.bEndpointAddress, 0,
						0);

					/* Reset the ZLP condition.  */
					transfer_request->ux_slave_transfer_request_force_zlp = UX_FALSE;

				} else {
					/* Set the completion code to no error.  */
					transfer_request->ux_slave_transfer_request_completion_code =
						UX_SUCCESS;

					/* The transfer is completed.  */
					transfer_request->ux_slave_transfer_request_status =
						UX_TRANSFER_STATUS_COMPLETED;
					transfer_request->ux_slave_transfer_request_actual_length =
						transfer_request->ux_slave_transfer_request_requested_length;

#if defined(UX_DEVICE_STANDALONE)

					/* Control status phase done.  */
					ed->ux_dcd_stm32_ed_status |= UX_DCD_STM32_ED_STATUS_DONE;
#endif

					/* We are using a Control endpoint, if there is a callback, invoke it.
					 * We are still under ISR.  */
					if (transfer_request->ux_slave_transfer_request_completion_function)
						transfer_request->ux_slave_transfer_request_completion_function(
							transfer_request);

					/* State is now STATUS RX.  */
					ed->ux_dcd_stm32_ed_state = UX_DCD_STM32_ED_STATE_STATUS_RX;
				}
			} else {
				/* Get the size of the transfer.  */
				transfer_length =
					transfer_request->ux_slave_transfer_request_in_transfer_length -
					endpoint->ux_slave_endpoint_descriptor.wMaxPacketSize;

				/* Check if the endpoint size is bigger that data requested. */
				if (transfer_length >
					endpoint->ux_slave_endpoint_descriptor.wMaxPacketSize) {
					/* Adjust the transfer size.  */
					transfer_length =
						endpoint->ux_slave_endpoint_descriptor.wMaxPacketSize;
				}

				/* Adjust the data pointer.  */
				transfer_request->ux_slave_transfer_request_current_data_pointer +=
					endpoint->ux_slave_endpoint_descriptor.wMaxPacketSize;

				/* Adjust the transfer length remaining.  */
				transfer_request->ux_slave_transfer_request_in_transfer_length -=
					transfer_length;

				/* Transmit data.  */
				HAL_PCD_EP_Transmit(
					hpcd, endpoint->ux_slave_endpoint_descriptor.bEndpointAddress,
					transfer_request->ux_slave_transfer_request_current_data_pointer,
					transfer_length);
			}
		}
	} else {
		/* Check if a ZLP should be armed.  */
		if (transfer_request->ux_slave_transfer_request_force_zlp &&
			transfer_request->ux_slave_transfer_request_requested_length) {
			/* Reset the ZLP condition.  */
			transfer_request->ux_slave_transfer_request_force_zlp = UX_FALSE;
			transfer_request->ux_slave_transfer_request_in_transfer_length = 0;

			/* Arm a ZLP packet on IN.  */
			HAL_PCD_EP_Transmit(hpcd, epnum, 0, 0);

		} else {
			/* Set the completion code to no error.  */
			transfer_request->ux_slave_transfer_request_completion_code = UX_SUCCESS;

			/* The transfer is completed.  */
			transfer_request->ux_slave_transfer_request_status =
				UX_TRANSFER_STATUS_COMPLETED;
			transfer_request->ux_slave_transfer_request_actual_length =
				transfer_request->ux_slave_transfer_request_requested_length;

#if defined(UX_DEVICE_STANDALONE)
			ed->ux_dcd_stm32_ed_status |= UX_DCD_STM32_ED_STATUS_DONE;
#else

			/* Non control endpoint operation, use semaphore.  */
			_ux_utility_semaphore_put(
				&transfer_request->ux_slave_transfer_request_semaphore);
#endif /* defined(UX_DEVICE_STANDALONE) */
		}
	}
}

void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum) {
	UX_SLAVE_DCD *dcd;
	UX_DCD_STM32 *dcd_stm32;
	UX_DCD_STM32_ED *ed;
	UX_SLAVE_TRANSFER *transfer_request;
	ULONG transfer_length;
	UX_SLAVE_ENDPOINT *endpoint;

	/* Get the pointer to the DCD.  */
	dcd = &_ux_system_slave->ux_system_slave_dcd;

	/* Get the pointer to the STM32 DCD.  */
	dcd_stm32 = (UX_DCD_STM32 *)dcd->ux_slave_dcd_controller_hardware;

	/* Fetch the address of the physical endpoint.  */
	ed = &dcd_stm32->ux_dcd_stm32_ed[epnum & 0xF];

	/* Get the pointer to the transfer request.  */
	transfer_request =
		&(ed->ux_dcd_stm32_ed_endpoint->ux_slave_endpoint_transfer_request);

	/* Endpoint 0 is different.  */
	if (epnum == 0U) {
		/* Check if we have received something on endpoint 0 during data phase .  */
		if (ed->ux_dcd_stm32_ed_state == UX_DCD_STM32_ED_STATE_DATA_RX) {
			/* Get the pointer to the logical endpoint from the transfer request.  */
			endpoint = transfer_request->ux_slave_transfer_request_endpoint;

			/* Read the received data length for the Control endpoint.  */
			transfer_length = HAL_PCD_EP_GetRxCount(hpcd, epnum);

			/* Update the length of the data received.  */
			transfer_request->ux_slave_transfer_request_actual_length += transfer_length;

