wtcat/mcuTask/board/stm32/h750_core/stm32_usbdevice.c
			/* Can we accept this much?  */
			if (transfer_request->ux_slave_transfer_request_actual_length <=
				transfer_request->ux_slave_transfer_request_requested_length) {
				/* Are we done with this transfer ? */
				if ((transfer_request->ux_slave_transfer_request_actual_length ==
					 transfer_request->ux_slave_transfer_request_requested_length) ||
					(transfer_length !=
					 endpoint->ux_slave_endpoint_descriptor.wMaxPacketSize)) {
#if defined(UX_DEVICE_STANDALONE)
					ed->ux_dcd_stm32_ed_status |= UX_DCD_STM32_ED_STATUS_SETUP_OUT;
#else
					_ux_dcd_stm32_setup_out(ed, transfer_request, hpcd);
#endif
				} else {
					/* Rearm the OUT control endpoint for one packet. */
					transfer_request->ux_slave_transfer_request_current_data_pointer +=
						endpoint->ux_slave_endpoint_descriptor.wMaxPacketSize;
					HAL_PCD_EP_Receive(
						hpcd, endpoint->ux_slave_endpoint_descriptor.bEndpointAddress,
						transfer_request->ux_slave_transfer_request_current_data_pointer,
						endpoint->ux_slave_endpoint_descriptor.wMaxPacketSize);
				}
			} else {
				/*  We have an overflow situation. Set the completion code to overflow. */
				transfer_request->ux_slave_transfer_request_completion_code =
					UX_TRANSFER_BUFFER_OVERFLOW;

				/* If trace is enabled, insert this event into the trace buffer.  */
				UX_TRACE_IN_LINE_INSERT(UX_TRACE_ERROR, UX_TRANSFER_BUFFER_OVERFLOW,
										transfer_request, 0, 0, UX_TRACE_ERRORS, 0, 0)

#if defined(UX_DEVICE_STANDALONE)

				/* Control status phase done.  */
				ed->ux_dcd_stm32_ed_status |= UX_DCD_STM32_ED_STATUS_DONE;
#endif

				/* We are using a Control endpoint, if there is a callback, invoke it. We
				 * are still under ISR.  */
				if (transfer_request->ux_slave_transfer_request_completion_function)
					transfer_request->ux_slave_transfer_request_completion_function(
						transfer_request);
			}
		}
	} else {
		/* Update the length of the data sent in previous transaction.  */
		transfer_request->ux_slave_transfer_request_actual_length =
			HAL_PCD_EP_GetRxCount(hpcd, epnum);

		/* Set the completion code to no error.  */
		transfer_request->ux_slave_transfer_request_completion_code = UX_SUCCESS;

		/* The transfer is completed.  */
		transfer_request->ux_slave_transfer_request_status = UX_TRANSFER_STATUS_COMPLETED;

#if defined(UX_DEVICE_STANDALONE)
		ed->ux_dcd_stm32_ed_status |= UX_DCD_STM32_ED_STATUS_DONE;
#else

		/* Non control endpoint operation, use semaphore.  */
		_ux_utility_semaphore_put(&transfer_request->ux_slave_transfer_request_semaphore);
#endif
	}
}

void HAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd) {
	/* If the device is attached or configured, we need to disconnect it.  */
	if (_ux_system_slave->ux_system_slave_device.ux_slave_device_state !=
		UX_DEVICE_RESET) {
		/* Disconnect the device.  */
		_ux_device_stack_disconnect();
	}

	/* Set USB Current Speed */
	switch (hpcd->Init.speed) {
#ifdef PCD_SPEED_HIGH
	case PCD_SPEED_HIGH:

		/* We are connected at high speed.  */
		_ux_system_slave->ux_system_slave_speed = UX_HIGH_SPEED_DEVICE;
		break;
#endif
	case PCD_SPEED_FULL:

		/* We are connected at full speed.  */
		_ux_system_slave->ux_system_slave_speed = UX_FULL_SPEED_DEVICE;
		break;

	default:

		/* We are connected at full speed.  */
		_ux_system_slave->ux_system_slave_speed = UX_FULL_SPEED_DEVICE;
		break;
	}

	/* Complete the device initialization.  */
	_ux_dcd_stm32_initialize_complete();

	/* Mark the device as attached now.  */
	_ux_system_slave->ux_system_slave_device.ux_slave_device_state = UX_DEVICE_ATTACHED;
}

void HAL_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd) {
	/* Check the status change callback.  */
	if (_ux_system_slave->ux_system_slave_change_function != UX_NULL) {
		/* Inform the application if a callback function was programmed.  */
		_ux_system_slave->ux_system_slave_change_function(UX_DCD_STM32_DEVICE_CONNECTED);
	}
}

void HAL_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd) {
	/* Check the status change callback.  */
	if (_ux_system_slave->ux_system_slave_change_function != UX_NULL) {
		/* Inform the application if a callback function was programmed.  */
		_ux_system_slave->ux_system_slave_change_function(
			UX_DCD_STM32_DEVICE_DISCONNECTED);
	}

	/* Check if the device is attached or configured.  */
	if (_ux_system_slave->ux_system_slave_device.ux_slave_device_state !=
		UX_DEVICE_RESET) {
		/* Disconnect the device.  */
		_ux_device_stack_disconnect();
	}
}

void HAL_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd) {
	/* Check the status change callback.  */
	if (_ux_system_slave->ux_system_slave_change_function != UX_NULL) {
		/* Inform the application if a callback function was programmed.  */
		_ux_system_slave->ux_system_slave_change_function(UX_DCD_STM32_DEVICE_SUSPENDED);
	}
}

void HAL_PCD_ResumeCallback(PCD_HandleTypeDef *hpcd) {
	/* Check the status change callback.  */
	if (_ux_system_slave->ux_system_slave_change_function != UX_NULL) {
		/* Inform the application if a callback function was programmed.  */
		_ux_system_slave->ux_system_slave_change_function(UX_DCD_STM32_DEVICE_RESUMED);
	}
}

void HAL_PCD_SOFCallback(PCD_HandleTypeDef *hpcd) {
	/* Check the status change callback.  */
	if (_ux_system_slave->ux_system_slave_change_function != UX_NULL) {
		/* Inform the application if a callback function was programmed.  */
		_ux_system_slave->ux_system_slave_change_function(UX_DCD_STM32_SOF_RECEIVED);
	}
}

void HAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum) {
	UX_SLAVE_DCD *dcd;
	UX_DCD_STM32 *dcd_stm32;
	UX_DCD_STM32_ED *ed;
	UX_SLAVE_ENDPOINT *endpoint;

	UX_PARAMETER_NOT_USED(epnum);

	/* Get the pointer to the DCD.  */
	dcd = &_ux_system_slave->ux_system_slave_dcd;

	/* Get the pointer to the STM32 DCD.  */
	dcd_stm32 = (UX_DCD_STM32 *)dcd->ux_slave_dcd_controller_hardware;

#if defined(UX_DEVICE_BIDIRECTIONAL_ENDPOINT_SUPPORT)
	ed = &dcd_stm32->ux_dcd_stm32_ed_in[epnum & 0xF];
#else
	ed = &dcd_stm32->ux_dcd_stm32_ed[epnum & 0xF];
#endif /* defined(UX_DEVICE_BIDIRECTIONAL_ENDPOINT_SUPPORT) */

	if ((ed->ux_dcd_stm32_ed_status & UX_DCD_STM32_ED_STATUS_USED) == 0U)
		return;

	endpoint = ed->ux_dcd_stm32_ed_endpoint;

	if ((endpoint->ux_slave_endpoint_descriptor.bmAttributes & UX_MASK_ENDPOINT_TYPE) ==
			1 &&
		(endpoint->ux_slave_endpoint_descriptor.bEndpointAddress &
		 UX_ENDPOINT_DIRECTION) != 0) {
		/* Incomplete, discard data and retry.  */
		HAL_PCD_EP_Transmit(dcd_stm32->pcd_handle,
							endpoint->ux_slave_endpoint_descriptor.bEndpointAddress,
							endpoint->ux_slave_endpoint_transfer_request
								.ux_slave_transfer_request_data_pointer,
							endpoint->ux_slave_endpoint_transfer_request
								.ux_slave_transfer_request_requested_length);
	}
}

void HAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum) {
	UX_SLAVE_DCD *dcd;
	UX_DCD_STM32 *dcd_stm32;
	UX_DCD_STM32_ED *ed;
	UX_SLAVE_ENDPOINT *endpoint;

	UX_PARAMETER_NOT_USED(epnum);

	/* Get the pointer to the DCD.  */
	dcd = &_ux_system_slave->ux_system_slave_dcd;

