wtcat/mcuTask/board/stm32/h750_core/stm32_usbdevice.c
	/* Get the pointer to the STM32 DCD.  */
	dcd_stm32 = (UX_DCD_STM32 *)dcd->ux_slave_dcd_controller_hardware;

	ed = &dcd_stm32->ux_dcd_stm32_ed[epnum & 0xF];
	if ((ed->ux_dcd_stm32_ed_status & UX_DCD_STM32_ED_STATUS_USED) == 0)
		return;

	endpoint = ed->ux_dcd_stm32_ed_endpoint;

	if ((endpoint->ux_slave_endpoint_descriptor.bmAttributes & UX_MASK_ENDPOINT_TYPE) ==
			1 &&
		(endpoint->ux_slave_endpoint_descriptor.bEndpointAddress &
		 UX_ENDPOINT_DIRECTION) == 0) {
		/* Incomplete, discard data and retry.  */
		HAL_PCD_EP_Receive(dcd_stm32->pcd_handle,
						   endpoint->ux_slave_endpoint_descriptor.bEndpointAddress,
						   endpoint->ux_slave_endpoint_transfer_request
							   .ux_slave_transfer_request_data_pointer,
						   endpoint->ux_slave_endpoint_transfer_request
							   .ux_slave_transfer_request_requested_length);
	}
}

STATIC_UINT _ux_dcd_stm32_endpoint_create(UX_DCD_STM32 *dcd_stm32, 
    UX_SLAVE_ENDPOINT *endpoint) {
	UX_DCD_STM32_ED *ed;
	ULONG stm32_endpoint_index;

	/* The endpoint index in the array of the STM32 must match the endpoint number.  */
	stm32_endpoint_index =
		endpoint->ux_slave_endpoint_descriptor.bEndpointAddress & ~UX_ENDPOINT_DIRECTION;

	/* Get STM32 ED.  */
	ed =
		_stm32_ed_get(dcd_stm32, endpoint->ux_slave_endpoint_descriptor.bEndpointAddress);

	if (ed == UX_NULL)
		return (UX_NO_ED_AVAILABLE);

	/* Check the endpoint status, if it is free, reserve it. If not reject this endpoint.
	 */
	if ((ed->ux_dcd_stm32_ed_status & UX_DCD_STM32_ED_STATUS_USED) == 0) {
		/* We can use this endpoint.  */
		ed->ux_dcd_stm32_ed_status |= UX_DCD_STM32_ED_STATUS_USED;

		/* Keep the physical endpoint address in the endpoint container.  */
		endpoint->ux_slave_endpoint_ed = (VOID *)ed;

		/* Save the endpoint pointer.  */
		ed->ux_dcd_stm32_ed_endpoint = endpoint;

		/* And its index.  */
		ed->ux_dcd_stm32_ed_index = stm32_endpoint_index;

		/* And its direction.  */
		ed->ux_dcd_stm32_ed_direction =
			endpoint->ux_slave_endpoint_descriptor.bEndpointAddress &
			UX_ENDPOINT_DIRECTION;

		/* Check if it is non-control endpoint.  */
		if (stm32_endpoint_index != 0) {
			/* Open the endpoint.  */
			HAL_PCD_EP_Open(dcd_stm32->pcd_handle,
							endpoint->ux_slave_endpoint_descriptor.bEndpointAddress,
							endpoint->ux_slave_endpoint_descriptor.wMaxPacketSize,
							endpoint->ux_slave_endpoint_descriptor.bmAttributes &
								UX_MASK_ENDPOINT_TYPE);
		}

		/* Return successful completion.  */
		return (UX_SUCCESS);
	}

	/* Return an error.  */
	return (UX_NO_ED_AVAILABLE);
}

STATIC_UINT _ux_dcd_stm32_endpoint_destroy(UX_DCD_STM32 *dcd_stm32,
									UX_SLAVE_ENDPOINT *endpoint) {
	UX_DCD_STM32_ED *ed;

	/* Keep the physical endpoint address in the endpoint container.  */
	ed = (UX_DCD_STM32_ED *)endpoint->ux_slave_endpoint_ed;

	/* We can free this endpoint.  */
	ed->ux_dcd_stm32_ed_status = UX_DCD_STM32_ED_STATUS_UNUSED;

	/* Deactivate the endpoint.  */
	HAL_PCD_EP_Close(dcd_stm32->pcd_handle,
					 endpoint->ux_slave_endpoint_descriptor.bEndpointAddress);

	/* This function never fails.  */
	return (UX_SUCCESS);
}

STATIC_UINT _ux_dcd_stm32_endpoint_reset(UX_DCD_STM32 *dcd_stm32, 
    UX_SLAVE_ENDPOINT *endpoint) {
	UX_INTERRUPT_SAVE_AREA
	UX_DCD_STM32_ED *ed;

	/* Get the physical endpoint address in the endpoint container.  */
	ed = (UX_DCD_STM32_ED *)endpoint->ux_slave_endpoint_ed;

	UX_DISABLE

	/* Set the status of the endpoint to not stalled.  */
	ed->ux_dcd_stm32_ed_status &=
		~(UX_DCD_STM32_ED_STATUS_STALLED | UX_DCD_STM32_ED_STATUS_DONE |
		  UX_DCD_STM32_ED_STATUS_SETUP);

	/* Set the state of the endpoint to IDLE.  */
	ed->ux_dcd_stm32_ed_state = UX_DCD_STM32_ED_STATE_IDLE;

	/* Clear STALL condition.  */
	HAL_PCD_EP_ClrStall(dcd_stm32->pcd_handle,
						endpoint->ux_slave_endpoint_descriptor.bEndpointAddress);

	/* Flush buffer.  */
	HAL_PCD_EP_Flush(dcd_stm32->pcd_handle,
					 endpoint->ux_slave_endpoint_descriptor.bEndpointAddress);

#ifndef UX_DEVICE_STANDALONE

	/* Wakeup pending thread.  */
	if (endpoint->ux_slave_endpoint_transfer_request.ux_slave_transfer_request_semaphore
			.tx_semaphore_suspended_count)
		_ux_utility_semaphore_put(&endpoint->ux_slave_endpoint_transfer_request
									   .ux_slave_transfer_request_semaphore);
#endif

	UX_RESTORE

	/* This function never fails.  */
	return (UX_SUCCESS);
}

STATIC_UINT _ux_dcd_stm32_endpoint_stall(UX_DCD_STM32 *dcd_stm32, 
    UX_SLAVE_ENDPOINT *endpoint) {
	UX_DCD_STM32_ED *ed;

	/* Get the physical endpoint address in the endpoint container.  */
	ed = (UX_DCD_STM32_ED *)endpoint->ux_slave_endpoint_ed;

	/* Set the endpoint to stall.  */
	ed->ux_dcd_stm32_ed_status |= UX_DCD_STM32_ED_STATUS_STALLED;

	/* Stall the endpoint.  */
	HAL_PCD_EP_SetStall(dcd_stm32->pcd_handle,
						endpoint->ux_slave_endpoint_descriptor.bEndpointAddress |
							ed->ux_dcd_stm32_ed_direction);

	/* This function never fails.  */
	return (UX_SUCCESS);
}

STATIC_UINT _ux_dcd_stm32_endpoint_status(UX_DCD_STM32 *dcd_stm32, 
    ULONG endpoint_index) {
	UX_DCD_STM32_ED *ed;

	/* Fetch the address of the physical endpoint.  */
	ed = _stm32_ed_get(dcd_stm32, endpoint_index);

	/* Check the endpoint status, if it is free, we have a illegal endpoint.  */
	if ((ed->ux_dcd_stm32_ed_status & UX_DCD_STM32_ED_STATUS_USED) == 0)
		return (UX_ERROR);

	/* Check if the endpoint is stalled.  */
	if ((ed->ux_dcd_stm32_ed_status & UX_DCD_STM32_ED_STATUS_STALLED) == 0)
		return (UX_FALSE);
	else
		return (UX_TRUE);
}

STATIC_UINT _ux_dcd_stm32_frame_number_get(UX_DCD_STM32 *dcd_stm32, 
    ULONG *frame_number) {
	/* This function never fails. */
	return (UX_SUCCESS);
}

STATIC_UINT _ux_dcd_stm32_transfer_abort(UX_DCD_STM32 *dcd_stm32,
								  UX_SLAVE_TRANSFER *transfer_request) {
#if !defined(USBD_HAL_TRANSFER_ABORT_NOT_SUPPORTED)

	UX_SLAVE_ENDPOINT *endpoint;

	/* Get the pointer to the logical endpoint from the transfer request.  */
	endpoint = transfer_request->ux_slave_transfer_request_endpoint;

	HAL_PCD_EP_Abort(dcd_stm32->pcd_handle,
					 endpoint->ux_slave_endpoint_descriptor.bEndpointAddress);
	HAL_PCD_EP_Flush(dcd_stm32->pcd_handle,
					 endpoint->ux_slave_endpoint_descriptor.bEndpointAddress);

