wtcat/mcuTask/board/stm32/h750_core/stm32_usbdevice.c
	/* No semaphore put here since it's already done in stack.  */
#endif /* USBD_HAL_TRANSFER_ABORT_NOT_SUPPORTED */

	/* Return to caller with success.  */
	return (UX_SUCCESS);
}

STATIC_UINT _ux_dcd_stm32_transfer_request(UX_DCD_STM32 *dcd_stm32,
									UX_SLAVE_TRANSFER *transfer_request) {
	UX_SLAVE_ENDPOINT *endpoint;
	UINT status;

	/* Get the pointer to the logical endpoint from the transfer request.  */
	endpoint = transfer_request->ux_slave_transfer_request_endpoint;

	/* Check for transfer direction.  Is this a IN endpoint ? */
	if (transfer_request->ux_slave_transfer_request_phase == UX_TRANSFER_PHASE_DATA_OUT) {
		/* Transmit data.  */
		HAL_PCD_EP_Transmit(dcd_stm32->pcd_handle,
							endpoint->ux_slave_endpoint_descriptor.bEndpointAddress,
							transfer_request->ux_slave_transfer_request_data_pointer,
							transfer_request->ux_slave_transfer_request_requested_length);

		/* If the endpoint is a Control endpoint, all this is happening under Interrupt
		   and there is no thread to suspend.  */
		if ((endpoint->ux_slave_endpoint_descriptor.bEndpointAddress &
			 (UINT)~UX_ENDPOINT_DIRECTION) != 0) {
			/* We should wait for the semaphore to wake us up.  */
			status = _ux_utility_semaphore_get(
				&transfer_request->ux_slave_transfer_request_semaphore,
				(ULONG)transfer_request->ux_slave_transfer_request_timeout);

			/* Check the completion code. */
			if (status != UX_SUCCESS)
				return (status);

			transfer_request->ux_slave_transfer_request_actual_length =
				transfer_request->ux_slave_transfer_request_requested_length;

			/* Check the transfer request completion code. We may have had a BUS reset or
			   a device disconnection.  */
			if (transfer_request->ux_slave_transfer_request_completion_code != UX_SUCCESS)
				return (transfer_request->ux_slave_transfer_request_completion_code);

			/* Return to caller with success.  */
			return (UX_SUCCESS);
		}
	} else {
		/* We have a request for a SETUP or OUT Endpoint.  */
		/* Receive data.  */
		HAL_PCD_EP_Receive(dcd_stm32->pcd_handle,
						   endpoint->ux_slave_endpoint_descriptor.bEndpointAddress,
						   transfer_request->ux_slave_transfer_request_data_pointer,
						   transfer_request->ux_slave_transfer_request_requested_length);

		/* If the endpoint is a Control endpoint, all this is happening under Interrupt
		   and there is no thread to suspend.  */
		if ((endpoint->ux_slave_endpoint_descriptor.bEndpointAddress &
			 (UINT)~UX_ENDPOINT_DIRECTION) != 0) {
			/* We should wait for the semaphore to wake us up.  */
			status = _ux_utility_semaphore_get(
				&transfer_request->ux_slave_transfer_request_semaphore,
				(ULONG)transfer_request->ux_slave_transfer_request_timeout);

			/* Check the completion code. */
			if (status != UX_SUCCESS)
				return (status);

			/* Check the transfer request completion code. We may have had a BUS reset or
			   a device disconnection.  */
			if (transfer_request->ux_slave_transfer_request_completion_code != UX_SUCCESS)
				return (transfer_request->ux_slave_transfer_request_completion_code);

			/* Return to caller with success.  */
			return (UX_SUCCESS);
		}
	}

	/* Return to caller with success.  */
	return (UX_SUCCESS);
}

STATIC_UINT _ux_dcd_stm32_function(UX_SLAVE_DCD *dcd, UINT function, VOID *parameter) {
	UINT status;
	UX_DCD_STM32 *dcd_stm32;

	/* Check the status of the controller.  */
	if (dcd->ux_slave_dcd_status == UX_UNUSED) {
		/* Error trap. */
		_ux_system_error_handler(UX_SYSTEM_LEVEL_THREAD, UX_SYSTEM_CONTEXT_DCD,
								 UX_CONTROLLER_UNKNOWN);

		/* If trace is enabled, insert this event into the trace buffer.  */
		UX_TRACE_IN_LINE_INSERT(UX_TRACE_ERROR, UX_CONTROLLER_UNKNOWN, 0, 0, 0,
								UX_TRACE_ERRORS, 0, 0)

		return (UX_CONTROLLER_UNKNOWN);
	}

	/* Get the pointer to the STM32 DCD.  */
	dcd_stm32 = (UX_DCD_STM32 *)dcd->ux_slave_dcd_controller_hardware;

	/* Look at the function and route it.  */
	switch (function) {
	case UX_DCD_GET_FRAME_NUMBER:

		status = _ux_dcd_stm32_frame_number_get(dcd_stm32, (ULONG *)parameter);
		break;

	case UX_DCD_TRANSFER_REQUEST:

#if defined(UX_DEVICE_STANDALONE)
		status = _ux_dcd_stm32_transfer_run(dcd_stm32, (UX_SLAVE_TRANSFER *)parameter);
#else
		status =
			_ux_dcd_stm32_transfer_request(dcd_stm32, (UX_SLAVE_TRANSFER *)parameter);
#endif /* defined(UX_DEVICE_STANDALONE) */
		break;

	case UX_DCD_TRANSFER_ABORT:
		status = _ux_dcd_stm32_transfer_abort(dcd_stm32, parameter);
		break;

	case UX_DCD_CREATE_ENDPOINT:

		status = _ux_dcd_stm32_endpoint_create(dcd_stm32, parameter);
		break;

	case UX_DCD_DESTROY_ENDPOINT:

		status = _ux_dcd_stm32_endpoint_destroy(dcd_stm32, parameter);
		break;

	case UX_DCD_RESET_ENDPOINT:

		status = _ux_dcd_stm32_endpoint_reset(dcd_stm32, parameter);
		break;

	case UX_DCD_STALL_ENDPOINT:

		status = _ux_dcd_stm32_endpoint_stall(dcd_stm32, parameter);
		break;

	case UX_DCD_SET_DEVICE_ADDRESS:

		status = HAL_PCD_SetAddress(dcd_stm32->pcd_handle, (uint8_t)(ULONG)parameter);
		break;

	case UX_DCD_CHANGE_STATE:

		if ((ULONG)parameter == UX_DEVICE_FORCE_DISCONNECT) {
			/* Disconnect the USB device */
			status = HAL_PCD_Stop(dcd_stm32->pcd_handle);
		} else {
			status = UX_SUCCESS;
		}

		break;

	case UX_DCD_ENDPOINT_STATUS:

		status = _ux_dcd_stm32_endpoint_status(dcd_stm32, (ULONG)parameter);
		break;

#if defined(UX_DEVICE_STANDALONE)
	case UX_DCD_ISR_PENDING:

		_ux_dcd_stm32_setup_isr_pending(dcd_stm32);
		status = UX_SUCCESS;
		break;
#endif /* defined(UX_DEVICE_STANDALONE) */

	default:

		/* Error trap. */
		_ux_system_error_handler(UX_SYSTEM_LEVEL_THREAD, UX_SYSTEM_CONTEXT_DCD,
								 UX_FUNCTION_NOT_SUPPORTED);

		/* If trace is enabled, insert this event into the trace buffer.  */
		UX_TRACE_IN_LINE_INSERT(UX_TRACE_ERROR, UX_FUNCTION_NOT_SUPPORTED, 0, 0, 0,
								UX_TRACE_ERRORS, 0, 0)

		status = UX_FUNCTION_NOT_SUPPORTED;
		break;
	}

	/* Return completion status.  */
	return (status);
}

STATIC_UINT _ux_dcd_stm32_initialize_complete(VOID) {
	UX_SLAVE_DCD *dcd;
	UX_DCD_STM32 *dcd_stm32;
	UX_SLAVE_DEVICE *device;
	UCHAR *device_framework;
	UX_SLAVE_TRANSFER *transfer_request;

	/* Get the pointer to the DCD.  */
	dcd = &_ux_system_slave->ux_system_slave_dcd;

