wtcat/mcuTask/board/stm32/h750_core/stm32_usbdevice.c
	/* Set the state of the controller to OPERATIONAL now.  */
	dcd->ux_slave_dcd_status = UX_DCD_STATUS_OPERATIONAL;

	/* Return successful completion.  */
	return (UX_SUCCESS);
}

static TX_SEMAPHORE dcd_irq_signal;
static TX_THREAD    dcd_irq_thread;
static ULONG        dcd_irq_stack[1024 / sizeof(ULONG)];
static PCD_HandleTypeDef usb_device_handle = {
	.Instance = USB_OTG_FS,
	.Init = {
		.dev_endpoints = UX_DCD_STM32_MAX_ED,
		.Host_channels = UX_DCD_STM32_MAX_ED,
		.speed = USBD_FS_SPEED,
		.ep0_mps = 0,
		.phy_itface = USB_OTG_EMBEDDED_PHY,
		.Sof_enable = 0,
		.lpm_enable = 0,
		.battery_charging_enable = 0,
		.vbus_sensing_enable = 0,
		.use_dedicated_ep1 = 0,
		.use_external_vbus = 0
	}
};

#define DEVICE_FRAMEWORK_LENGTH_FULL_SPEED 50
static UCHAR device_framework_full_speed[] = { 
    /* Device descriptor */
        0x12, 0x01, 0x10, 0x01, 0x00, 0x00, 0x00, 0x08,
        0xec, 0x08, 0x10, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x01,                                      

    /* Configuration descriptor */
        0x09, 0x02, 0x20, 0x00, 0x01, 0x01, 0x00, 0xc0,
        0x32, 

    /* Interface descriptor */
        0x09, 0x04, 0x00, 0x00, 0x02, 0x99, 0x99, 0x99,
        0x00,

    /* Endpoint descriptor (Bulk Out) */
        0x07, 0x05, 0x01, 0x02, 0x40, 0x00, 0x00,

    /* Endpoint descriptor (Bulk In) */
        0x07, 0x05, 0x82, 0x02, 0x40, 0x00, 0x00 
};
    
#define DEVICE_FRAMEWORK_LENGTH_HIGH_SPEED 60
static UCHAR device_framework_high_speed[] = { 
    /* Device descriptor */
        0x12, 0x01, 0x00, 0x02, 0x00, 0x00, 0x00, 0x40,
        0x0a, 0x07, 0x25, 0x40, 0x01, 0x00, 0x01, 0x02,
        0x03, 0x01,                                      

    /* Device qualifier descriptor */
        0x0a, 0x06, 0x00, 0x02, 0x00, 0x00, 0x00, 0x40,
        0x01, 0x00,

    /* Configuration descriptor */
        0x09, 0x02, 0x20, 0x00, 0x01, 0x01, 0x00, 0xc0,
        0x32, 

    /* Interface descriptor */
        0x09, 0x04, 0x00, 0x00, 0x02, 0x99, 0x99, 0x99,
        0x00,

    /* Endpoint descriptor (Bulk Out) */
        0x07, 0x05, 0x01, 0x02, 0x00, 0x02, 0x00,

    /* Endpoint descriptor (Bulk In) */
        0x07, 0x05, 0x82, 0x02, 0x00, 0x02, 0x00 
};
    
/* String Device Framework :
    Byte 0 and 1 : Word containing the language ID : 0x0904 for US
    Byte 2       : Byte containing the index of the descriptor
    Byte 3       : Byte containing the length of the descriptor string
*/
#define STRING_FRAMEWORK_LENGTH 38
static UCHAR string_framework[] = { 
    /* Manufacturer string descriptor : Index 1 */
        0x09, 0x04, 0x01, 0x0c, 
        0x45, 0x78, 0x70, 0x72,0x65, 0x73, 0x20, 0x4c, 
        0x6f, 0x67, 0x69, 0x63,

    /* Product string descriptor : Index 2 */
        0x09, 0x04, 0x02, 0x0c, 
        0x44, 0x61, 0x74, 0x61, 0x50, 0x75, 0x6d, 0x70, 
        0x44, 0x65, 0x6d, 0x6f,  

    /* Serial Number string descriptor : Index 3 */
        0x09, 0x04, 0x03, 0x04, 
        0x30, 0x30, 0x30, 0x31
};

/* Multiple languages are supported on the device, to add
    a language besides English, the unicode language code must
    be appended to the language_id_framework array and the length
    adjusted accordingly. */
#define LANGUAGE_ID_FRAMEWORK_LENGTH 2
static UCHAR language_id_framework[] = { 
    /* English. */
    0x09, 0x04
};


static void _ux_dcd_stm32_interrupt_thread(void *arg) {
	(void) arg;

	for ( ; ; ) {
		tx_semaphore_get(&dcd_irq_signal, TX_WAIT_FOREVER);

		/* Process host controller interrupt */
		_ux_dcd_stm32_interrupt_handler();
	}
}

static void __fastcode _ux_dcd_stm32_interrupt_routine(void *arg) {
	PCD_HandleTypeDef *pcd = &usb_device_handle;
	PCD_TypeDef *reg = pcd->Instance;
	uint32_t sta = reg->GINTSTS;

	/* Clear pending interrupt flags */
	reg->GINTSTS = sta;
	pcd->Pending = sta & reg->GINTMSK;

	/* If does have any interrupt pending then wake up interrupt thread */
	if (pcd->Pending)
		tx_semaphore_ceiling_put(&dcd_irq_signal, 1);
}

static int stm32_usbdevice_irq_initialize(void) {
	const int nr_irqs[] = {
		OTG_FS_EP1_OUT_IRQn,
		OTG_FS_EP1_IN_IRQn,
		OTG_FS_WKUP_IRQn,
		OTG_FS_IRQn
	};

	/* Create interrupt sync semaphore */
	tx_semaphore_create(&dcd_irq_signal, "dcd_signal", 0);

	/* Create interrupt service thread */
	tx_thread_spawn(&dcd_irq_thread, "hcd_irq", _ux_dcd_stm32_interrupt_thread, 
		0, dcd_irq_stack, sizeof(dcd_irq_stack), 8, 8, TX_NO_TIME_SLICE, TX_AUTO_START);
	
	/* Install hardware interrupt process handler */
	for (size_t i = 0; i < rte_array_size(nr_irqs); i++) {
		int err = request_irq(nr_irqs[i], _ux_dcd_stm32_interrupt_routine, NULL);
		if (err)
			return err;
	}

	return 0;
}

static int stm32_usbdevice_init(void) {
	static ULONG _ux_memory[UX_MEMORY_SIZE / sizeof(ULONG)];
	UINT err;

	HAL_PCD_Init(&usb_device_handle);

	/* Install hardware interrupt service for USB host controller */
	err = (UINT)stm32_usbdevice_irq_initialize();
	if (err)
		return err;	

	/* Initialize USBX Memory.  */
	err = _ux_system_initialize(_ux_memory, sizeof(_ux_memory), UX_NULL, 0);
	if (err != UX_SUCCESS)
		return _UX_ERR(err);

    /* Initialize USB device stack */
    err = _ux_device_stack_initialize(
            device_framework_high_speed, DEVICE_FRAMEWORK_LENGTH_HIGH_SPEED,
            device_framework_full_speed, DEVICE_FRAMEWORK_LENGTH_FULL_SPEED,
            string_framework, STRING_FRAMEWORK_LENGTH,
            language_id_framework, LANGUAGE_ID_FRAMEWORK_LENGTH, UX_NULL);
    if (err)
        return _UX_ERR(err);

    err = _ux_dcd_stm32_initialize(0, (ULONG)&usb_device_handle);
    if (err)
        return _UX_ERR(err);

    /* Register USB storage class */
    // err = ux_device_stack_class_register(_ux_system_slave_class_storage_name,
    //     ux_device_class_storage_entry, 1, 0, &class_storage);

    return 0;
}

SYSINIT(stm32_usbdevice_init, SI_BUSDRIVER_LEVEL, 60);
